posts/general-notes-on-data-lakes/index.org
#+BEGIN_COMMENT
.. title: General Notes on Data Lakes
.. slug: general-notes-on-data-lakes
.. date: 2021-05-27 16:57:36 UTC+02:00
.. tags: Data
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT


Some general notes on data lakes. Sum up a bit the general decisions
in the data world.

More interesting is the Zaloni approach discussed later in the notes.

{{{TEASER_END}}}

* Important points

Perhaps more important, most data warehouses require that business
users rely on IT to do any manipulation or enrichment of data, largely
because of the inflexible design, system complexity, and intolerance
for human error in data warehouses. This slows down business
innovation.

*Schema-on-read allows users to build custom schemas into their queries
upon query execution.*

Unlike a monolithic view of a single enterprise-wide data model, the
data lake allows you to put off modeling until you actually use the
data, which creates opportunities for better operational insights and
data discovery.

Data warehouses are notorious for not being able to scale beyond a
certain volume due to restrictions of the architecture. Data
processing takes so long that organizations are prevented from
exploiting all their data to its fullest extent.

Because data can be unstructured as well as structured, you can store
everything from blog postings to product reviews. And the data doesn’t
need to be consistent to be stored in a data lake.

This would be problematic in a data warehouse; in a data lake,
however, you can put all sorts of data into a single repository
without worrying about schemas that define the integration points
between different data sets.

Unlike data warehouses, data lakes don’t come with governance built
in. This augments the risk of creating a proper data swamp.

Metadata is not automatically applied when data is ingested into the
data lake.  Without the technical, operational, and business metadata
that gives you information about the data you have, it is impossible
to organize your data lake and apply governance policies. Metadata is
what allows you to track data lineage, monitor and understand data
quality, enforce data privacy and role-based security, and manage data
life cycle policies. This is particularly critical for organizations
in tightly regulated industries.

* On-premise vs. Cloud

Whether to use on-premises or cloud storage and processing is a complicated
and important decision point for any organization.

Generally speaking, on-premises storage and processing offers tighter
control over data security and data privacy, whereas public cloud
systems offer highly scalable and elastic storage and computing
resources to meet enterprises’ need for large scale processing and
data storage without having the overheads of provisioning and
maintaining expensive infrastructure.

* Schema on Write vs. Schema on Read

This is the essential difference between data lakes and traditional
data warehouses.

** Schema on Write

 Schema on write is defined as creating a schema for data before
 writing into the database. If you have done any kind of development
 with a database you understand the structured nature of Relational
 Database(RDBMS) because you have used Structured Query Language (SQL)
 to read data from the database. This is the standard ETL pipeline.
 Transformation to fit the desired schema is necessary in traditional
 data warehouses.

 Remember just because the data is structured doesn’t mean it starts
 out that way. Most of the data that exist is in an unstructured
 fashion. Not only do you have to define the schema for the data but
 you must also structure it based on that schema.

** Schema on Read

 Schema on read differs from schema on write because you create the
 schema only when reading the data. Structured is applied to the data
 only when it’s read, this allows unstructured data to be stored in the
 database. Since it’s not necessary to define the schema before storing
 the data it makes it easier to bring in new data sources on the fly.

 The exploding growth of unstructured data and overhead of ETL for
 storing data in RDBMS is the main reason for shift to schema on
 read. This is why the most companies are shifting to datalakes.

[[https://www.thomashenson.com/schema-read-vs-schema-write-explained/][nice overview over databases technologies history and schema on write
vs schema on read]].

