posts/general-notes-on-data-lakes/index.html
<!DOCTYPE html>
<html prefix="        og: http://ogp.me/ns# article: http://ogp.me/ns/article#     " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>General Notes on Data Lakes | Bits of Experience</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://marcohassan.github.io/bits-of-experience/posts/general-notes-on-data-lakes/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Marco Hassan">
<link rel="prev" href="../istio/" title="Istio" type="text/html">
<link rel="next" href="../helm/" title="Helm" type="text/html">
<meta property="og:site_name" content="Bits of Experience">
<meta property="og:title" content="General Notes on Data Lakes">
<meta property="og:url" content="https://marcohassan.github.io/bits-of-experience/posts/general-notes-on-data-lakes/">
<meta property="og:description" content="Some general notes on data lakes. Sum up a bit the general decisions
in the data world.



More interesting is the Zaloni approach discussed later in the notes.





Important points


Perhaps more im">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-27T16:57:36+02:00">
<meta property="article:tag" content="Data">
</head>
<body>
    <a href="#page-content" class="sr-only sr-only-focusable">Skip to main content</a>
    
    <section class="social"><ul>
<li><a href="../../pages/aboutme/" title="About me"><i class="fa fa-user-circle"></i></a></li>
            <li><a href="../../pages/bits-of-experience-a-readable-view-on-my-study-adventures/" title="Home"><i class="fa fa-home"></i></a></li>
            <li><a href="../../index.html" title="Blog"><i class="fa fa-edit"></i></a></li>
            <li><a href="../../pages/emacs/" title="A life Configuring Emacs"><i class="fa fa-code"></i></a></li>
            <li><a href="../../pages/papers/" title="Term and Research Papers"><i class="fa fa-university"></i></a></li>
            <li><a href="../../pages/foto-blog/" title="Foto Blog"><i class="fa fa-camera-retro"></i></a></li>
            <li><a href="https://github.com/MarcoHassan" title="My Github"><i class="fab fa-github"></i></a></li>
            <li><a href="https://stackoverflow.com/users/9731177/mhass" title="My Stack"><i class="fab fa-stack-overflow"></i></a></li>
            <li><a href="../../rss.xml" title="RSS"><i class="fa fa-rss"></i></a></li>
            <li><a href="../../categories/index.html" title="Tags"><i class="fa fa-tags"></i></a></li>
    
    

        </ul></section><section class="page-content"><div class="content" rel="main">
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">General Notes on Data Lakes</a></h1>

        <div class="metadata">
            <p class="dateline"><a href="." rel="bookmark"><i class="fa fa-clock"></i> <time class="published dt-published" datetime="2021-05-27T16:57:36+02:00" itemprop="datePublished" title="2021-05-27 16:57">2021-05-27 16:57</time></a></p>
            <p class="byline author vcard"> <i class="fa fa-user"></i> <span class="byline-name fn" itemprop="author">
                    Marco Hassan
            </span></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink"><i class="fa fa-file-code"></i> Source</a></p>

            

            
    <div class="tags">
<h3 class="metadata-title">
<i class="fa fa-tags"></i> Tags:</h3>
        <ul itemprop="keywords" class="tags-ul">
<li><a class="tag p-category" href="../../categories/data/" rel="tag">Data</a></li>
        </ul>
</div>

        </div>
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Some general notes on data lakes. Sum up a bit the general decisions
in the data world.
</p>

<p>
More interesting is the Zaloni approach discussed later in the notes.
</p>

<!-- TEASER_END -->

<div id="outline-container-orgd945e6f" class="outline-2">
<h2 id="orgd945e6f">Important points</h2>
<div class="outline-text-2" id="text-orgd945e6f">
<p>
Perhaps more important, most data warehouses require that business
users rely on IT to do any manipulation or enrichment of data, largely
because of the inflexible design, system complexity, and intolerance
for human error in data warehouses. This slows down business
innovation.
</p>

<p>
<b>Schema-on-read allows users to build custom schemas into their queries
upon query execution.</b>
</p>

<p>
Unlike a monolithic view of a single enterprise-wide data model, the
data lake allows you to put off modeling until you actually use the
data, which creates opportunities for better operational insights and
data discovery.
</p>

<p>
Data warehouses are notorious for not being able to scale beyond a
certain volume due to restrictions of the architecture. Data
processing takes so long that organizations are prevented from
exploiting all their data to its fullest extent.
</p>

<p>
Because data can be unstructured as well as structured, you can store
everything from blog postings to product reviews. And the data doesn’t
need to be consistent to be stored in a data lake.
</p>

<p>
This would be problematic in a data warehouse; in a data lake,
however, you can put all sorts of data into a single repository
without worrying about schemas that define the integration points
between different data sets.
</p>

<p>
Unlike data warehouses, data lakes don’t come with governance built
in. This augments the risk of creating a proper data swamp.
</p>

<p>
Metadata is not automatically applied when data is ingested into the
data lake.  Without the technical, operational, and business metadata
that gives you information about the data you have, it is impossible
to organize your data lake and apply governance policies. Metadata is
what allows you to track data lineage, monitor and understand data
quality, enforce data privacy and role-based security, and manage data
life cycle policies. This is particularly critical for organizations
in tightly regulated industries.
</p>
</div>
</div>

<div id="outline-container-org062ee47" class="outline-2">
<h2 id="org062ee47">On-premise vs. Cloud</h2>
<div class="outline-text-2" id="text-org062ee47">
<p>
Whether to use on-premises or cloud storage and processing is a complicated
and important decision point for any organization.
</p>

<p>
Generally speaking, on-premises storage and processing offers tighter
control over data security and data privacy, whereas public cloud
systems offer highly scalable and elastic storage and computing
resources to meet enterprises’ need for large scale processing and
data storage without having the overheads of provisioning and
maintaining expensive infrastructure.
</p>
</div>
</div>

<div id="outline-container-orgdd6ad4a" class="outline-2">
<h2 id="orgdd6ad4a">Schema on Write vs. Schema on Read</h2>
<div class="outline-text-2" id="text-orgdd6ad4a">
<p>
This is the essential difference between data lakes and traditional
data warehouses.
</p>
</div>

<div id="outline-container-org8d760b4" class="outline-3">
<h3 id="org8d760b4">Schema on Write</h3>
<div class="outline-text-3" id="text-org8d760b4">
<p>
Schema on write is defined as creating a schema for data before
writing into the database. If you have done any kind of development
with a database you understand the structured nature of Relational
Database(RDBMS) because you have used Structured Query Language (SQL)
to read data from the database. This is the standard ETL pipeline.
Transformation to fit the desired schema is necessary in traditional
data warehouses.
</p>

<p>
Remember just because the data is structured doesn’t mean it starts
out that way. Most of the data that exist is in an unstructured
fashion. Not only do you have to define the schema for the data but
you must also structure it based on that schema.
</p>
</div>
</div>

<div id="outline-container-orgc44df74" class="outline-3">
<h3 id="orgc44df74">Schema on Read</h3>
<div class="outline-text-3" id="text-orgc44df74">
<p>
Schema on read differs from schema on write because you create the
schema only when reading the data. Structured is applied to the data
only when it’s read, this allows unstructured data to be stored in the
database. Since it’s not necessary to define the schema before storing
the data it makes it easier to bring in new data sources on the fly.
</p>

<p>
The exploding growth of unstructured data and overhead of ETL for
storing data in RDBMS is the main reason for shift to schema on
read. This is why the most companies are shifting to datalakes.
</p>

<p>
<a href="https://www.thomashenson.com/schema-read-vs-schema-write-explained/">nice overview over databases technologies history and schema on write
vs schema on read</a>.
</p>
</div>
</div>
</div>
