posts/general-notes-on-data-lakes/index.html

<div id="outline-container-org983f8f0" class="outline-2">
<h2 id="org983f8f0">Storage options</h2>
<div class="outline-text-2" id="text-org983f8f0">
<p>
A sample technology stack for the storage function of a data lake may consist of
the following:
</p>

<ul class="org-ul">
<li>Hadoop Distributed File System (HDFS)</li>
</ul>
<p>
A Java-based filesystem that provides scalable and reliable data
storage. It is designed to span large clusters of commodity
servers. For on-premises data lakes, HDFS seems to be the storage of
choice because it is highly reliable, fault tolerant, scalable, and
can store structured and unstructured data. This allows for faster
processing of the big data use-cases. HDFS also allows enterprises
to create storage tiers to allow for data life cycle management, using
those tiers to save costs while maintaining data retention policies
and regulatory requirements.
</p>

<ul class="org-ul">
<li>Object storage</li>
</ul>
<p>
Object stores (Amazon Simple Storage Service [Amazon S3], Microsoft
Azure Blob Storage, Google Cloud Storage) provide scalable, reliable
data storage. Cloud-based storage offers a unique advantage. They are
designed to decouple storage from computing so that they can autoscale
compute power to meet the real-time processing needs.
</p>

<ul class="org-ul">
<li>Apache Hive tables</li>
</ul>
<p>
An open source <b>data warehouse</b> system for querying and analyzing large
datasets stored in Hadoop files.
</p>

<ul class="org-ul">
<li>HBase</li>
</ul>
<p>
An open source, nonrelational, distributed database that is modeled
after Google’s BigTable. Developed as part of Apache Software
Foundation’s Apache Hadoop project, it runs on top of HDFS, providing
BigTable-like capabilities for Hadoop.
</p>

<ul class="org-ul">
<li>ElasticSearch</li>
</ul>
<p>
An open source, RESTful search engine built on top of Apache Lucene
and released under an Apache license. It is Java-based and can search
and index document files in diverse formats.
</p>
</div>
</div>

<div id="outline-container-orgbd979b4" class="outline-2">
<h2 id="orgbd979b4">Batch vs Streaming Data Processing</h2>
<div class="outline-text-2" id="text-orgbd979b4">
<p>
Batch processing is where the processing happens of blocks of data
that have already been stored over a period of time. For example,
processing all the transaction that have been performed by a major
financial firm in a week.
</p>

<p>
Batch processing works well in situations where you don’t need
real-time analytics results, and when it is more important to process
large volumes of data to get more detailed insights than it is to get
fast analytics results.
</p>

<p>
Stream processing is a golden key if you want analytics results in
real time. Stream processing allows us to process data in real time as
they arrive and quickly detect conditions within small time period
from the point of receiving the data. 
</p>

<p>
In Batch Processing it processes over all or most of the data but In
Stream Processing it processes over data on rolling window or most
recent record. So Batch Processing handles a large batch of data while
Stream processing handles Individual records or micro batches of few
records.
</p>

<p>
Stream processing allows you to feed data into analytics tools as soon
as they get generated and get instant analytics results. There are
multiple open source stream processing platforms such as Apache Kafka,
Apache Flink, Apache Storm, Apache Samza, etc.
</p>

<p>
Different tools are needed, based on whether your use case involves
batch or streaming. For batch use cases, organizations generally use
Pig, Hive, Spark, and MapReduce. For streaming use cases, they would
likely use different tools such as Spark-Streaming, Kafka, Flume, and
Storm.
</p>

<p>
Interesting here is especially: <b>Apache Beam</b>
</p>

<p>
Apache Beam provides an abstraction on top of the processing
cluster. It is an open source framework that allows you to use a
single programming model for both batch and streaming use cases, and
execute pipelines on multiple execution environments like Spark,
Flink, and others. By utilizing Beam, enterprises can develop their
data processing pipelines using Beam SDK and then choose a Beam Runner
to run the pipelines on a specific largescale data processing
system. The runner can be a number of things: a Direct Runner, Apex,
Flink, Spark, Dataflow, or Gearpump (incubating). This design allows
for the processing pipeline to be portable across different runners,
thereby providing flexibility to the enterprises to take advantage of
the best platform to meet their data processing requirements in a
future-proof way.  Data Lake
</p>
</div>
</div>

<div id="outline-container-org115ec92" class="outline-2">
<h2 id="org115ec92">Data lake management</h2>
<div class="outline-text-2" id="text-org115ec92">
<p>
Data lakes created with an integrated data management framework can
eliminate the cumbersome data preparation process of ETL that
traditional data warehouse requires. Data is smoothly ingested into
the data lake, where it is managed using metadata tags that help
locate and connect the information when business users need it. This
approach frees analysts for the important task of finding value in the
data without involving IT in every step of the process, thus
conserving IT resources.
</p>

<p>
Key to a solid data management and governance strategy is having the
right metadata management structure in place. With accurate and
descriptive meta-data, you can set policies and standards for
managing and using data.
</p>
</div>
</div>

<div id="outline-container-org641c237" class="outline-2">
<h2 id="org641c237">Zaloni Schema</h2>
<div class="outline-text-2" id="text-org641c237">
<p>
A reference architecture is a framework that organizations can refer to in order
to
</p>

<ol class="org-ol">
<li>understand industry best practices</li>
<li>track a process and the steps it takes,</li>
<li>derive a template for solutioning</li>
<li>understand the components and technologies involved</li>
</ol>
<p>
We recommend organizing your data lake into four zones, plus a
sandbox. Throughout the zones, data is tracked, validated, cataloged,
assigned metadata, refined, and more.
</p>
</div>

<div id="outline-container-orgad07438" class="outline-3">
<h3 id="orgad07438">Zone 1: The Transient Landing Zone</h3>
<div class="outline-text-3" id="text-orgad07438">
<p>
We recommend loading data into a transient loading zone, where basic
data quality checks are performed using MapReduce or Spark processing
capabilities.
</p>

<p>
Many firms moreover require strict regulation over the saved
data. Think about companies saving personal &amp; confidential data. This
is where the importance of the transient landing zone becomes
clear. Data will be encrypted and masked in this zone so that all of
the data requirements are met.
</p>

<p>
The transient zone is temporary; it is a landing zone for data where
security measures can be applied before it is stored or accessed. With
GDPR being enacted in the EU, this zone might become even more
important because there will be higher levels of regulation and
compliance, applicable to more industries.
</p>
</div>
</div>

<div id="outline-container-orga451215" class="outline-3">
<h3 id="orga451215">Zone 2: The Raw Zone</h3>
<div class="outline-text-3" id="text-orga451215">
<p>
After the quality checks and security transformations have been performed in the
Transient Zone, the data is then loaded into in the Raw Data zone for storage.
However, in some situations, a Transient Zone is not needed, and the Raw Zone
is the beginning of the data lake journey.
</p>

<p>
Within this zone, you can mask or tokenize data as needed, add it to
catalogs, and enhance it with metadata. In the Raw Zone, data is
stored permanently and in its original form, so it is known as “the
single source of truth.”
</p>
</div>
</div>
