posts/general-notes-on-data-lakes/index.org
** Zone 3: The Trusted Zone

The Trusted Zone imports data from the Raw Zone. This is where data is
altered so that it is in compliance with all government and industry
policies as well as checked for quality. Organizations perform
standard data cleansing and data validation methods here.

Often the data within this zone is known as a “single version of
truth.”

*This trusted repository can contain both master data and reference
data. Master data is a compilation of the basic datasets that have
been cleansed and validated. An organization needs to ensure that data
kept in the trusted zone is up to date using change data capture (CDC)
mechanisms.* (this is what you were operating on at Expedia).

Reference data, on the other hand, is considered the single version of
truth for more complex, blended datasets. For example, that healthcare
organization might have a reference dataset that merges information
from multiple source tables in the master data store.

** Zone 4: The Refined Zone

Within the Refined Zone, data goes through its last few steps before
being used to derive insights. Data here is integrated into a common
format for ease of use, and goes through possible detokenization,
further quality checks, and life cycle management. This ensures that
the data is in a format from which you can easily use it to create
models. Consumers of this zone are those with appropriate role-based
access.

Data is often transformed to reflect the needs of specific lines of
business in this zone.

** Sandbox

The Sandbox is integral to a data lake because it allows data
scientists and managers to create ad hoc exploratory use cases
without the need to involve the IT department.

Data can be imported into the Sandbox from any of the zones, as well
as directly from the source. This allows companies to explore how
certain variables could affect business outcomes and therefore derive
further insights to help make business management decisions. You can
send some of these insights directly back to the raw zone, allowing
derived data to act as sourced data and thus giving data scientists
and analysts more with which to work.

* Data Ingestion

Organizations have a number of options when transferring data to a
data lake.  Managed ingestion gives you control over how data is
ingested, where it comes from, when it arrives, and where it is stored
in the data lake.

With managed ingestion, data (both structured and unstructured) and
metadata are linked. There are two approaches to link data and
metadata. 

- The first approach is when metadata is known; for example, a meta
  file that describes the column name and data type that comes with
  the data file (consider for instance the case of importing data from
  an existing datawarehouse with named columns).

- The second approach is when metadata is not known ahead of time and
  the data stewards identify and tag individual cells after data is
  ingested.

The result is a giant table: "With managed ingestion, you enter all
data into a giant table organized with metadata tags. Each piece of
data—whether a customer’s name, a photograph, or a Facebook post—is
placed in an individual cell. It doesn’t matter where in the data lake
that individual cell is located, where the data came from, or its
format.  You can connect all of the data easily through the tags. You
can add or change tags as your analytic requirements evolve—one of the
key distinctions between a data warehouse and a data lake."

Using a managed ingestion process with a data lake opens up tremendous
possibilities. *You can quickly and easily ingest unstructured data
and make it available for analysis without needing to transform it in
any way*.

/Regulating Privacy:/

You can also protect sensitive information. As data is ingested into
the data lake and moves from the Transient Zone to the Raw Zone, each
cell is tagged according to how “visible” it is to different users in
the organization.

An integrated data lake management platform will perform managed
ingestion, which involves getting the data from the source systems
into the data lake, guaranteeing a repeatable process, and ensuring
that if anything fails in the ingest cycle, there will be operational
functions that take care of it.

*** The Stream Data Ingestion Case

Additionally, as we see more and more workloads moving to streaming,
whatever data management functions you applied to batch ingestion—when
data was coming in periodically—now needs to be applied to data that
is streaming in continuously. Integrated data lake management
platforms should be able to detect whether certain streams are not
being ingested based on the service-level agree‐ ments (SLAs) you set.

Additionally, as we see more and more workloads moving to streaming,
whatever data management functions you applied to batch ingestion—when
data was coming in periodically—now needs to be applied to data that
is streaming in continuously. Integrated data lake management
platforms should be able to detect whether certain streams are not
being ingested based on.


*** Top Down vs. Bottom Up Data Governance Approach

In a bottom-up approach, consumers of the data lake are probably data
scientists or data analysts. Collective input from these consumers
decides which datasets are valuable and useful and have good quality
data. The data lake then exposes those datasets to other consumers so
that they can see the ways that their peers have been successful with
the data lake. (this was the way expedia operated).

A top-down method takes best practices from organizations’ data
warehouse experiences and attempts to impose governance and management
from the moment the data is ingested into the data lake.

* Trends and Opportunities

** Logical Data Lakes & Federated Queries

 We are seeing more and more requirements for hybrid data stores, in
 which data can be stored not only in Hadoop Distributed File System
 (HDFS), but also in object data stores, such as Amazon Simple Storage
 Service (Amazon S3) or Microsoft Azure Elastic Block storage, or in
 No-SQL databases.

 To make this work, enterprises need a *unified view of data that
 exists across these multiple data stores* across the multiple
 environments in an enterprise.

 The integration of these various technologies and stores within an
 organization can lead to what is, in effect, a logical data lake.

 This goes hand in hand with the necessity of running *federated
 queries*. As data is stored in different physical and virtual
 environments, you might need to use different query tools and
 decompose a user’s query into multiple queries—sending them to
 on-premises data stores as well as cloud-based data stores, each of
 which possesses part of the answer. Then, the answers are aggregated
 and combined and sent back to the user such that they get one version
 of the truth across the entire logical data lake.

 /The above would be big revolution/. /Would be interesting to read
 about how much research is going into the area/.

